; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-3nodes-1000size-3degree-100mindistance-5trucks-2packages-220seed

(define (problem transport-three-cities-sequential-3nodes-1000size-3degree-100mindistance-5trucks-2packages-220seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  truck-5 - vehicle
  package-1 - package
  package-2 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 238,737 -> 765,782
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 53)
  ; 765,782 -> 238,737
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 53)
  ; 255,465 -> 765,782
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 60)
  ; 765,782 -> 255,465
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 60)
  ; 255,465 -> 238,737
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 28)
  ; 238,737 -> 255,465
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 28)
  ; 2411,424 -> 2282,737
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 34)
  ; 2282,737 -> 2411,424
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 34)
  ; 2502,223 -> 2282,737
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 56)
  ; 2282,737 -> 2502,223
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 56)
  ; 2502,223 -> 2411,424
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 23)
  ; 2411,424 -> 2502,223
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 23)
  ; 1241,2494 -> 1726,2333
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 52)
  ; 1726,2333 -> 1241,2494
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 52)
  ; 1918,2167 -> 1726,2333
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 26)
  ; 1726,2333 -> 1918,2167
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 26)
  ; 765,782 <-> 2282,737
  (road city-1-loc-1 city-2-loc-1)
  (= (road-length city-1-loc-1 city-2-loc-1) 152)
  (road city-2-loc-1 city-1-loc-1)
  (= (road-length city-2-loc-1 city-1-loc-1) 152)
  (road city-1-loc-1 city-3-loc-1)
  (= (road-length city-1-loc-1 city-3-loc-1) 152)
  (road city-3-loc-1 city-1-loc-1)
  (= (road-length city-3-loc-1 city-1-loc-1) 152)
  (road city-2-loc-1 city-3-loc-1)
  (= (road-length city-2-loc-1 city-3-loc-1) 152)
  (road city-3-loc-1 city-2-loc-1)
  (= (road-length city-3-loc-1 city-2-loc-1) 152)
  (at package-1 city-2-loc-2)
  (at package-2 city-2-loc-3)
  (at truck-1 city-1-loc-1)
  (capacity truck-1 capacity-4)
  (at truck-2 city-3-loc-1)
  (capacity truck-2 capacity-2)
  (at truck-3 city-1-loc-3)
  (capacity truck-3 capacity-4)
  (at truck-4 city-3-loc-2)
  (capacity truck-4 capacity-3)
  (at truck-5 city-1-loc-2)
  (capacity truck-5 capacity-2)
 )
 (:goal (and
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-1 city-1-loc-1 city-2-loc-1)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-2-loc-1)
   goals met: 0 of 2
2. (drive truck-1 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-3)
   goals met: 0 of 2
3. (pick-up truck-1 city-2-loc-3 package-2 capacity-3 capacity-4)
   deleted: (at package-2 city-2-loc-3) (capacity truck-1 capacity-4)
   added: (in package-2 truck-1) (capacity truck-1 capacity-3)
   goals met: 0 of 2
4. (drive truck-1 city-2-loc-3 city-2-loc-2)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-2)
   goals met: 0 of 2
5. (pick-up truck-1 city-2-loc-2 package-1 capacity-2 capacity-3)
   deleted: (at package-1 city-2-loc-2) (capacity truck-1 capacity-3)
   added: (in package-1 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 2
6. (drive truck-1 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-2-loc-1)
   goals met: 0 of 2
7. (drive truck-1 city-2-loc-1 city-1-loc-1)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-1-loc-1)
   goals met: 0 of 2
8. (drop truck-1 city-1-loc-1 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-2)
   added: (at package-1 city-1-loc-1) (capacity truck-1 capacity-3)
   goals met: 1 of 2
9. (drive truck-1 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-3)
   goals met: 1 of 2
10. (drop truck-1 city-1-loc-3 package-2 capacity-3 capacity-4)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-3)
   added: (at package-2 city-1-loc-3) (capacity truck-1 capacity-4)
   goals met: 2 of 2
